In [2]:
%matplotlib inline

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
df = pd.DataFrame(np.random.randn(5,3),
                 index= list(range(1,6)),
                 columns=list('ABC'))

In [5]:
df

          A         B         C
1 -0.412421  0.435870  1.527319
2  0.039094 -0.004284 -1.605831
3 -1.219574 -0.591386 -0.087169
4  1.818893  1.280534  0.659779
5 -0.166654 -0.848710  1.962008

In [6]:
df[df.B>0] #只印出B有>0的那幾行

          A         B         C
1 -0.412421  0.435870  1.527319
4  1.818893  1.280534  0.659779

In [7]:
df[df>0]

          A         B         C
1       NaN  0.435870  1.527319
2  0.039094       NaN       NaN
3       NaN       NaN       NaN
4  1.818893  1.280534  0.659779
5       NaN       NaN  1.962008

In [8]:
 #locate可以找出我們要找的東西
df.loc[2:3,"B":"c"]

          B         C
2 -0.004284 -1.605831
3 -0.591386 -0.087169

In [9]:
df.loc[2,"B"]

-0.00428350984475849

In [10]:
df.loc[2,"B"]=1
#打算直接把df裡面的2B位置改成1，要用loc才能改到df裡面的值

In [11]:
df

          A         B         C
1 -0.412421  0.435870  1.527319
2  0.039094  1.000000 -1.605831
3 -1.219574 -0.591386 -0.087169
4  1.818893  1.280534  0.659779
5 -0.166654 -0.848710  1.962008

In [12]:
df.loc[df.B>0,"C"]=0
#把b>0的地方的C都改成0

In [13]:
df

          A         B         C
1 -0.412421  0.435870  0.000000
2  0.039094  1.000000  0.000000
3 -1.219574 -0.591386 -0.087169
4  1.818893  1.280534  0.000000
5 -0.166654 -0.848710  1.962008